---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PartMakerSplitterProfileEdgeMatch
source: html/3db6609d-62ba-ceda-4862-5d68ab4c3440.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PartMakerSplitterProfileEdgeMatch Property

"Edge Match"

## Syntax (C#)
```csharp
public static ForgeTypeId PartMakerSplitterProfileEdgeMatch { get; }
```